Tekla Open API Reference for Tekla Structures 2025
PositionTypeAttribute Constructor
Overload List
Name | Description
PositionTypeAttribute(Int32)
 The custom attribute [PositionType()] uses this to store the position type to the system. This is not to be used by itself.
PositionTypeAttribute(PositionTypeEnum)
 The custom attribute [PositionType()] uses this to store the position type to the system. This is not to be used by itself.
Top
See Also
Reference
PositionTypeAttribute Class
Tekla.Structures.Plugins Namespace